{
    "link": "https://codeforces.com//contest/700/problem/A",
    "problemId": "66132",
    "problem_idx": "A",
    "shortId": "700A",
    "contest_number": "700",
    "problem_submissions": {
        "E": [
            24594748,
            158561725,
            158550290
        ],
        "C": [
            19345625,
            19382048,
            19338136,
            19340095,
            19340301,
            19337933,
            19340888,
            19340881,
            19340439,
            19343320,
            19342147,
            19343241,
            19336239,
            19344979,
            19337688,
            19345735,
            19344599
        ],
        "D": [
            19338795,
            19343784,
            19338575,
            19351010,
            19367015,
            19366989,
            19347563,
            19447172,
            19403026,
            19402917,
            19402596,
            19384510,
            157407262
        ],
        "B": [
            19331219,
            19332414,
            19339798,
            19330514,
            19333849,
            19334131,
            19329268,
            19335879,
            19332140,
            19330791,
            19333504,
            19333302,
            19336092,
            19330270,
            19335712,
            19342616,
            19337619,
            19335938
        ],
        "A": [
            19329325,
            19331230,
            19341005,
            19330573,
            19330510,
            19343948,
            19331088,
            19333400,
            19345881,
            19331775,
            19336434,
            19335266,
            19334161,
            19341301,
            19332102,
            19332761
        ]
    },
    "name": "A. As Fast As Possible",
    "statement": "On vacations pupils decided to go on excursion and gather all together.\r\nThey need to overcome the path with the length meters. Each of the\r\npupils will go with the speed equal to . To get to the excursion\r\nquickly, it was decided to rent a bus, which has seats for people (it\r\nmeans that it can’t fit more than people at the same time) and the speed\r\nequal to . In order to avoid seasick, each of the pupils want to get\r\ninto the bus .Determine the minimum time required for all pupils to\r\nreach the place of excursion. Consider that the embarkation and\r\ndisembarkation of passengers, as well as the reversal of the bus, take\r\nplace immediately and this time can be neglected.\r\n",
    "solutions": [
        "#include<stdio.h>\ndouble T;\nint n, v1, v2, L, K;\nint main(){\n    int i, C;\n    scanf(\"%d%d%d%d%d\",&n,&L,&v1,&v2,&K);\n    C = (n-1)/K+1;\n    double bb = 0, ee = 1e15, LL;\n    for(i=0;i<100;i++){\n        T = (bb+ee)*0.5;\n        LL = (T - T*(v2-v1)/(v1+v2)) * v2 * (C-1) + T * v2;\n        if(LL > L){\n            ee = T;\n        }\n        else bb = T;\n    }\n    printf(\"%.11lf\\n\", T + (L - v2*T)  / v1 );\n}\n"
    ],
    "input": "",
    "output": "",
    "tags": [
        "binary search",
        "math"
    ],
    "dificulty": "1900",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV1\\A. As Fast As Possible.json",
    "editorial_link": "https://codeforces.com//blog/entry/46283",
    "editorial": "This problem can be solved with formula or with help of the binary search.\n\nLet's describe the solution with binary search on the answer. If the target function of the binary search returns true we need to move in mid the right end of the search, else we need to move in mid the left end of the search. The target function must works in the following way. Let's divide all pupils on the groups, the number of the groups equals to (n?+?k?-?1)?/?k, where n is the total number of pupils and k is the number of seats in the bus.\n\nThen for the current mid we know the minimal time which the first group of the pupils is needed to ride on the bus to reach the finish point in the time mid. Then we need to solve simple equation and get that this time equals to T?-?(v2·T?-?(l?-?posM))?/?(v2?-?v1), where for the first group T equals to mid, posM equals to 0 (in posM we will store the position of the pupils, who did not already rode on the bus). Than we need to accurate recalculate T and posM for every following group (do not forget that the bus must returns back to get the other group). If for some group v2·T became less than l?-?posM or T became less than 0, the target function must return false. If all groups of pupils will reach the finish point in time mid the target function must return true. Also do not forget that the bus does not need to ride back after it took to the needed point the last group of the pupils.",
    "hint": []
}