{
    "link": "https://codeforces.com//contest/594/problem/A",
    "problemId": "40378",
    "problem_idx": "A",
    "shortId": "594A",
    "contest_number": "594",
    "problem_submissions": {
        "E": [
            16759125
        ],
        "A": [
            14859835,
            14187151,
            14168211,
            14172935,
            14182638
        ],
        "B": [
            14156236,
            14148350,
            14148054,
            14157567,
            14148683,
            14153705,
            14154342,
            14148482,
            14159536,
            14174689,
            14159892,
            14159855,
            14159731
        ],
        "D": [
            14150984,
            14155176,
            14155954,
            14153436,
            14155957,
            14149401,
            14158502,
            14157969,
            14149011,
            14149866,
            14152166,
            14149390,
            14153522,
            14151360,
            14154138,
            14150754,
            14152455
        ],
        "C": [
            14148084,
            14150600,
            14150845,
            14151161,
            14152433,
            14158444,
            14151325,
            14153060,
            14153280,
            14152819,
            14149839,
            14153721,
            14148614,
            14156263,
            14151875,
            14156017,
            14156027
        ]
    },
    "name": "A. Warrior and Archer",
    "statement": "Vova and Lesha are friends. They often meet at Vova’s place and compete\r\nagainst each other in a computer game named The Ancient Papyri:\r\nSwordsink. Vova always chooses a warrior as his fighter and Leshac\r\nchooses an archer. After that they should choose initial positions for\r\ntheir characters and start the fight. A warrior is good at melee combat,\r\nso Vova will try to make the distance between fighters as small as\r\npossible. An archer prefers to keep the enemy at a distance, so Lesha\r\nwill try to make the initial distance as large as possible.There are (\r\nis always even) possible starting positions for characters marked along\r\nthe axis. The positions are given by their distinct coordinates , two\r\ncharacters cannot end up at the same position.Vova and Lesha take turns\r\nbanning available positions, Vova moves first. During each turn one of\r\nthe guys bans exactly one of the remaining positions. Banned positions\r\ncannot be used by Vova and Lesha. They continue to make moves until\r\nthere are only two possible positions remaining (thus, the total number\r\nof moves will be ). After that Vova’s character takes the position with\r\nthe lesser coordinate and Lesha’s character takes the position with the\r\nbigger coordinate and the guys start fighting.Vova and Lesha are already\r\ntired by the game of choosing positions, as they need to play it before\r\nevery fight, so they asked you (the developer of the The Ancient Papyri:\r\nSwordsink) to write a module that would automatically determine the\r\ndistance at which the warrior and the archer will start fighting if both\r\nVova and Lesha play optimally.\r\n",
    "solutions": [
        "#include<cstdio>\n#include<algorithm>\n#include<cstring>\n#include<iostream>\n#include<cstdlib>\n#include<cmath>\n#include<vector>\n#include<map>\n#include<set>\n#include<queue>\n#include<bitset>\nusing namespace std;\ntypedef long long ll;\ntypedef double db;\nconst db pi=acos(-1);\nvoid gn(int &x){\n    int sg=1;char c;while(((c=getchar())<'0'||c>'9')&&c!='-');\n    if(c=='-')sg=-1,x=0;else x=c-'0';\n    while((c=getchar())>='0'&&c<='9')x=x*10+c-'0';\n    x*=sg;\n}\nvoid gn(ll &x){\n    int sg=1;char c;while(((c=getchar())<'0'||c>'9')&&c!='-');\n    if(c=='-')sg=-1,x=0;else x=c-'0';\n    while((c=getchar())>='0'&&c<='9')x=x*10+c-'0';\n    x*=sg;\n}\nconst int mo=1000000007;\nconst int inf=1061109567;\nint qp(int a,ll b){int ans=1;do{if(b&1)ans=1ll*ans*a%mo;a=1ll*a*a%mo;}while(b>>=1);return ans;}\nint dx[4]={1,0,-1,0};\nint dy[4]={0,1,0,-1};\nint n;\nint a[222222];\nint main()\n{\n    gn(n);\n    for (int i=1;i<=n;i++)gn(a[i]);\n    sort(a+1,a+1+n);\n    int m=n-(n-1>>1)-1;\n    int mi=2100000000;\n    for (int i=1;i+m<=n;i++)mi=min(mi,a[i+m]-a[i]);\n    printf(\"%d\\n\",mi);\n    return 0;\n}"
    ],
    "input": "",
    "output": "",
    "tags": [
        "games"
    ],
    "dificulty": "2300",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV1\\A. Warrior and Archer.json",
    "editorial_link": "https://codeforces.com//blog/entry/21487",
    "editorial": "Let's sort the points by increasing x coordinate and work with sorted points array next.\n\nLet's suppose that after optimal playing points numbered l and r (l?<?r) are left. It's true that the first player didn't ban any of the points numbered i l?<?i?<?r, otherwise he could change his corresponding move to point l or point r (one could prove it doesn't depend on second player optimal moves) and change the optimal answer. It turns out that all the  points banned by the first player have numbers outside of [l,?r] segment, therefore . We should notice that if the first player choosed any [l,?r] for , he could always make the final points numbers located inside this segment.\n\nThe second player wants to make  (he couldn't make less), what is equivalent if he always ban points inside final [l,?r] segment (numbered l?<?i?<?r). As soon as the second player doesn't know what segment first player have chosen after every of his moves, he must detect a point which satisfies him in every first player choice. It's true number of this point is the median of set of point numbers left (the odd number) after the first player move. The number of moves of the first player left is lesser by one than moves of the second player, so the first player later could ban some points from the left and some points from the right, except three middle points. Two of it (leftmost and rightmost ones) shouldn't be banned by the second player as soon as it could increase the size of banned points from the left (or from the right), but third middle point satisfies the second player in every first player choice. This way the second player always bans the point inside final point segment.\n\nThus the answer is the minimum between every of  values."
}