{
    "link": "https://codeforces.com//contest/98/problem/C",
    "problemId": "514",
    "problem_idx": "C",
    "shortId": "98C",
    "contest_number": "98",
    "problem_submissions": {
        "D": [
            559046,
            560437,
            558160,
            558952,
            559593,
            560171,
            559775,
            560524,
            560585
        ],
        "C": [
            557680,
            558912,
            558966,
            558795,
            564197,
            559465,
            559563,
            560488,
            559529
        ],
        "A": [
            555563,
            555550,
            556122,
            555809,
            555571,
            555798,
            555472,
            555675,
            557529,
            556303,
            555989,
            556333,
            557311,
            555713,
            556337,
            560215
        ],
        "E": [
            566997
        ],
        "B": []
    },
    "name": "C. Help Greg the Dwarf",
    "statement": "A very unusual citizen lives in a far away kingdom Dwarf Gracula.\r\nHowever, his unusual name is not the weirdest thing (besides, everyone\r\nlong ago got used to calling him simply Dwarf Greg). What is special\r\nabout Dwarf Greg he’s been living for over 200 years; besides, he lives\r\nin a crypt on an abandoned cemetery and nobody has ever seen him out in\r\ndaytime. Moreover, nobody has ever seen Greg buy himself any food.\r\nThat’s why nobody got particularly surprised when after the infernal\r\ndragon’s tragic death cattle continued to disappear from fields. The\r\npeople in the neighborhood were long sure that the harmless dragon was\r\nnever responsible for disappearing cattle (considering that the dragon\r\nused to be sincere about his vegetarian views). But even that’s not the\r\nworst part of the whole story.The worst part is that merely several\r\nminutes ago Dwarf Greg in some unintelligible way got inside your house\r\nand asked you to help him solve a problem. The point is that a short\r\ntime ago Greg decided to order a new coffin (knowing his peculiar\r\ncharacter, you are not surprised at all). But the problem is: a very\r\nlong in both directions L-shaped corridor leads to Greg’s crypt, and you\r\ncan’t drag just any coffin through that corridor. That’s why he asked\r\nyou to help. You’ve formalized the task on a plane like this: let the\r\ncorridor’s width before and after the turn be equal to and\r\ncorrespondingly (see the picture). The corridor turns directly at a\r\nright angle, the coffin is a rectangle whose length and width are equal\r\nto and () correspondingly. Dwarf Greg has already determined the\r\ncoffin’s length (), which is based on his height; your task is to\r\ndetermine the coffin’s maximally possible width (), at which it can be\r\nbrought to the crypt. Besides, due to its large mass (pure marble!) the\r\ncoffin is equipped with rotating wheels; therefore it is impossible to\r\nlift it off the ground, however, arbitrary moves and rotations of the\r\ncoffin in the plane become possible. The coffin may be rotated\r\narbitrarily just before you drag it into crypt and move through the\r\ncorridor.Greg promised that if you help him, he will grant you\r\nimmortality (I wonder how?). And if you don’t, well... trust me, you\r\ndon’t want to know what happens if you don’t help him...\r\n",
    "solutions": [
        "#include<stdio.h>\n#include<math.h>\n#include<algorithm>\nusing namespace std;\ndouble a,b,l;\ndouble pi=acos((double)-1);\ninline double solve(){\n    if(a>b)swap(a,b);\n    if(l<=a)return l;\n    else if(l<=b)return a;\n    else{\n\tdouble th=atan(cbrt(a/b));\n\tdouble maxl=b/cos(th)+a/sin(th);\n\tif(l>maxl+1e-7)return -1000;\n\tdouble ll=0,rr=pi/2;\n\tfor(int k=0;k<50;k++){\n\t    double mm=(ll+rr)/2;\n\t    double d=-a*sin(mm)+b*cos(mm)-l*cos(2*mm);\n\t    if(d<0)ll=mm;\n\t    else rr=mm;\n\t}\n\treturn a*cos(ll)+b*sin(ll)-l*sin(2*ll)/2;\n    }\n}\nint main(){\n    scanf(\"%lf%lf%lf\",&a,&b,&l);\n    double t=solve();\n    if(t>=0)printf(\"%.7lf\\n\",solve());\n    else puts(\"My poor head =(\");\n}\n"
    ],
    "input": "",
    "output": "",
    "tags": [
        "geometry",
        "ternary search"
    ],
    "dificulty": "2500",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV1\\C. Help Greg the Dwarf.json",
    "editorial_link": "https://codeforces.com/blog/entry/2323",
    "editorial": "For this problem I assumed numerical solution. But there are several cases to consider. Below without loss of generality we assume a <= b.\n1. l <= a <= b. In this case the answer is restricted by the length of the coffin, so the answer is l and it is clear that the coffin l x l can be brought through the corridor (a, b) - let's denote corridor's sizes in this way.\n2. a < l <= b. In this case the answer is a, and it is clear that no larger number can be an answer. Indeed, otherwise the coffin (w > a) x (l > a) is impossible to drag through the corridor (a, b).\n3. a <= b < l. This is the most general case, where we should rotate the coffin inside the corridor where it has a kink. To maximise the width of the coffin, we want to move it in such a way that one corner of the coffin touches one outer wall of the corridor (suppose bottommost on the picture), and another corner adjacent to the same long side of the coffin touches another outer wall of the corridor (leftmost on the picture). Let's introduce coordinate system in such a way that bottommost wall be OX axis, and leftmost wall - OY axis. Suppose that during the \"rotation\" process one corner of the coffin is at the point (x,0) (0 <= x <= l), then another corner should be at the point (0,sqrt(l*l-x*x)). And the answer we search for is min {distance from the segment (x,0) - (0,sqrt(l*l-x*x)) to the point (a,b) }, where you take min{} over all 0 <= x <= l. Let this distance at point x be f(x). Since f(x*) is minimal in some point x* and increases everywere to the left and to the right from x*, one may use ternary search to find its minimum.\nExact solution for this problem is also possible: you can reduce the problem to minimizing the dot product of the vectors (a-x,b) and (-x,sqrt(l*l-x*x)) over x. But this leads to the neccessity to find the roots of the fourth-degree polynomial, which is not the best idea during the contest.",
    "hint": []
}