{
    "link": "https://codeforces.com//contest/1137/problem/D",
    "problemId": "309120",
    "problem_idx": "D",
    "shortId": "1137D",
    "contest_number": "1137",
    "problem_submissions": {
        "C": [
            51278692,
            51013174,
            51012138,
            51014594,
            51060015,
            51011758,
            51015377,
            51058095,
            51060423,
            51013462,
            51011929,
            51013820,
            51016620,
            51021729,
            51016142,
            51022376,
            51017039,
            51022733
        ],
        "D": [
            51022280,
            51016149,
            51021902,
            51016444,
            51017886,
            51022110,
            51022575,
            51017121,
            51017510,
            51026190,
            51017887,
            51020056,
            51071936,
            51020439,
            51057402,
            51015057,
            51021542,
            51016650
        ],
        "F": [
            51021456,
            51151872,
            51044265,
            208399382,
            208399328,
            51370362,
            51370305,
            56076657,
            51062431,
            51062375,
            51201422,
            51152102
        ],
        "E": [
            51015510,
            51019659,
            51017815,
            51022086,
            51024208,
            51025483,
            51015317,
            51021155,
            51026207,
            51019242,
            51116875,
            51022655,
            51043942,
            51019234,
            51021992,
            51040600
        ],
        "B": [
            51007898,
            51008699,
            51007790,
            51010637,
            51008661,
            51008854,
            51009928,
            51010030,
            51008543,
            51011271,
            51008351,
            51008938,
            51007902,
            51007130,
            51009176,
            51009835,
            51007086,
            51008751,
            51007248
        ],
        "A": [
            51006589,
            51007409,
            51005936,
            51007585,
            51007232,
            51007035,
            51007494,
            51006878,
            51006201,
            51013385,
            51006659,
            51007366,
            51005796,
            51010835,
            51007279,
            51007757,
            51009144,
            51007439,
            51005946
        ]
    },
    "name": "D. Cooperative Game",
    "statement": "Misha likes to play cooperative games with incomplete information. Today\r\nhe suggested ten his friends to play a cooperative game \"Lake\".Misha has\r\nalready come up with a field for the upcoming game. The field for this\r\ngame is a directed graph consisting of two parts. The first part is a\r\nroad along the coast of the lake which is a cycle of c vertices. The\r\nsecond part is a path from home to the lake which is a chain of t\r\nvertices, and there is an edge from the last vertex of this chain to the\r\nvertex of the road along the coast which has the most beautiful view of\r\nthe lake, also known as the finish vertex. Misha decided to keep the\r\nfield secret, so nobody knows neither t nor c. Note that each vertex of\r\nthe field has exactly one outgoing edge and all the vertices except the\r\nhome vertex and the finish vertex have exactly one ingoing edge. The\r\nhome vertex has no incoming edges, the finish vertex has two incoming\r\nedges.At the beginning of the game pieces of all the ten players,\r\nindexed with consecutive integers from 0 to 9, are at the home vertex.\r\nAfter that on each turn some of the players can ask Misha to\r\nsimultaneously move their pieces along the corresponding edges. Misha\r\nwill not answer more than q such queries. After each move Misha will\r\ntell players whose pieces are at the same vertices and whose pieces are\r\nat different vertices.The goal of the game is to move all the pieces to\r\nthe finish vertex. Misha’s friends have no idea how to win in such a\r\ngame without knowledge of c, t and q, but luckily they are your friends.\r\nHelp them: coordinate their actions to win the game. Misha has drawn\r\nsuch a field that 1\r\nle t, c, (t+c)\r\nleq 1000 and q = 3\r\ncdot (t+c).\r\n",
    "solutions": [
        "#include <bits/stdc++.h>\n\nusing namespace std;\n\nint read() {\n  int x;\n  cin >> x;\n  string s;\n  for (int i = 0; i < x; ++i) {\n    cin >> s;\n  }\n  return x;\n}\n\nint main() {\n  do {\n    cout << \"next 0 1\" << endl;\n    read();\n    cout << \"next 0\" << endl;\n  } while (read() > 2);\n  do {\n    cout << \"next 0 1 2 3 4 5 6 7 8 9\" << endl;\n  } while (read() > 1);\n  cout << \"done\" << endl;\n  return 0;\n}\n"
    ],
    "input": "",
    "output": "",
    "tags": [
        "constructive algorithms",
        "interactive",
        "number theory"
    ],
    "dificulty": "2400",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV1\\D. Cooperative Game.json",
    "editorial_link": "https://codeforces.com/blog/entry/65825",
    "editorial": "The count of friends you have in the problem was actually a misleading.\r\nHere is how to solve this problem with only three of them.Letâs name\r\nthem , , , and then consider the following process: and moves forward,\r\nthen only, then and again and so on until at some moment they will\r\nappear in same vertex on cycle ( takes the lead, makes it to the cycle,\r\ncircles there until makes it to the cycle too, and then approaches him,\r\nreducing the distance between them by every moves).Here you can notice,\r\nthat had no time to make even one full circle on cycle, because in that\r\ncase would managed to make at least two full circles and they would meet\r\nearlier. Let denote the distance from finish vertex to the one and met.\r\nThen () and (). Also () as soon as had a move at each step and had only\r\non the odd ones.Substitute () and () into () and you would get .\r\nSimplify it and take in modulo to get , i.e. if you would now apply\r\nmoves to and they would end up in finish vertex, and if we instead\r\nsomehow would manage to apply exactly moves to all friends, all of them\r\nwould end up in the finish vertex. Here is the last bit of the solution:\r\ninstead of trying to compute letâs just move all friends until all of\r\nthem would meet in one vertex that vertex will be the finish\r\none.Described solution takes less than steps in the first stage and\r\nexactly steps in the second stage, so in total it would made less than .\r\n",
    "hint": []
}