{"link": "https://codeforces.com//contest/248/problem/A", "problemId": "2265", "problem_idx": "A", "shortId": "248A", "contest_number": "248", "problem_submissions": {"E": [2649329, 2666555, 2670742], "C": [2647083, 2645782, 2644570, 2645026, 2644143, 2646018, 2646002, 2646393, 2645569, 2646511, 2646914, 2645391, 2646255, 2646251, 2646956, 2646183, 2647244, 2647055], "B": [2643322, 2643726, 2643149, 2643654, 2645176, 2645012, 2644994, 2643618, 2647620, 2643812, 2643918, 2646274, 2644810, 2644905, 2644568, 2644808, 2644058, 2644407], "A": [2642156, 2642135, 2642120, 2642490, 2642087, 2642114, 2642102, 2642090, 2642543, 2642959, 2642616, 2642092, 2642321, 2643225, 2643200, 2646252, 2642288, 2643406], "D": [2657603, 2671870]}, "name": "A. Cupboards", "statement": "One foggy Stockholm morning, Karlsson decided to snack on some jam in\r\nhis friend Lillebror Svantenson’s house. Fortunately for Karlsson, there\r\nwasn’t anybody in his friend’s house. Karlsson was not going to be\r\nhungry any longer, so he decided to get some food in the\r\nhouse.Karlsson’s gaze immediately fell on wooden cupboards, standing in\r\nthe kitchen. He immediately realized that these cupboards have hidden\r\njam stocks. Karlsson began to fly greedily around the kitchen, opening\r\nand closing the cupboards’ doors, grab and empty all the jars of jam\r\nthat he could find.And now all jars of jam are empty, Karlsson has had\r\nenough and does not want to leave traces of his stay, so as not to let\r\ndown his friend. Each of the cupboards has two doors: the left one and\r\nthe right one. Karlsson remembers that when he rushed to the kitchen,\r\nall the cupboards’ left doors were in the same position (open or\r\nclosed), similarly, all the cupboards’ right doors were in the same\r\nposition (open or closed). Karlsson wants the doors to meet this\r\ncondition as well by the time the family returns. Karlsson does not\r\nremember the position of all the left doors, also, he cannot remember\r\nthe position of all the right doors. Therefore, it does not matter to\r\nhim in what position will be all left or right doors. It is important to\r\nleave all the left doors in the same position, and all the right doors\r\nin the same position. For example, all the left doors may be closed, and\r\nall the right ones may be open.Karlsson needs one second to open or\r\nclose a door of a cupboard. He understands that he has very little time\r\nbefore the family returns, so he wants to know the minimum number of\r\nseconds , in which he is able to bring all the cupboard doors in the\r\nrequired position.Your task is to write a program that will determine\r\nthe required number of seconds .\r\n", "solutions": ["#include<cstdio>\n#include<iostream>\n#include<cstdlib>\n#include<cstring>\n#include<algorithm>\nusing namespace std;\n\nint main()\n{\n    int n;\n    scanf(\"%d\",&n);\n    int ll=0,rr=0;\n    for (int i=0;i<n;i++)\n    {\n        int l,r;\n        scanf(\"%d%d\",&l,&r);\n        if (l) ll++;\n        if (r) rr++;\n    }\n    if (ll*2>n) ll=n-ll;\n    if (rr*2>n) rr=n-rr;\n    printf(\"%d\\n\",ll+rr);\n    return 0;\n}\n"], "input": "", "output": "", "tags": ["implementation"], "dificulty": "800", "interactive": false}