{
    "link": "https://codeforces.com//contest/471/problem/A",
    "problemId": "14291",
    "problem_idx": "A",
    "shortId": "471A",
    "contest_number": "471",
    "problem_submissions": {
        "D": [
            7965405,
            7963038,
            7965335,
            7968421,
            7966244,
            7968397,
            7967934,
            7967754,
            7962449,
            7971169,
            7966737,
            7967640,
            7966907,
            7965389,
            7968194,
            7968684,
            7968144,
            7968063,
            7969059,
            7969743
        ],
        "C": [
            7963799,
            7964161,
            7963025,
            7965860,
            7964576,
            7965647,
            7964444,
            7963849,
            7964165,
            7964646,
            7964390,
            7964067,
            7964677,
            7967841,
            7964930,
            7962467,
            7965383,
            7966049,
            7964548,
            7964611
        ],
        "B": [
            7962693,
            7961062,
            7959880,
            7962852,
            7961634,
            7961073,
            7961603,
            7961941,
            7966053,
            7965991,
            7961463,
            7961486,
            7962239,
            7963641,
            7962519,
            7960810,
            7962445,
            7961115,
            7962351,
            7961842
        ],
        "A": [
            7960020,
            7958602,
            7958473,
            7958790,
            7958822,
            7958588,
            7958849,
            7958927,
            7967090,
            7966996,
            7958571,
            7958632,
            7958550,
            7959873,
            7959046,
            7969496,
            7958766,
            7958587,
            7958630,
            7959368
        ]
    },
    "name": "A. MUH and Sticks",
    "statement": "Two polar bears Menshykov and Uslada from the St.Petersburg zoo and\r\nelephant Horace from the Kiev zoo got six sticks to play with and assess\r\nthe animals’ creativity. Menshykov, Uslada and Horace decided to make\r\neither an elephant or a bear from those sticks. They can make an animal\r\nfrom sticks in the following way: Four sticks represent the animal’s\r\nlegs, these sticks should have the same length. Two remaining sticks\r\nrepresent the animal’s head and body. The bear’s head stick must be\r\nshorter than the body stick. The elephant, however, has a long trunk, so\r\nhis head stick must be as long as the body stick. Note that there are no\r\nlimits on the relations between the leg sticks and the head and body\r\nsticks. Your task is to find out which animal can be made from the given\r\nstick set. The zoo keeper wants the sticks back after the game, so they\r\nmust never be broken, even bears understand it.\r\n",
    "solutions": [
        "#include <vector>\n#include <list>\n#include <queue>\n#include <map>\n#include <set>\n#include <deque>\n#include <stack>\n#include <bitset>\n#include <algorithm>\n#include <functional>\n#include <numeric>\n#include <utility>\n#include <sstream>\n#include <iostream>\n#include <iomanip>\n#include <cstdio>\n#include <cmath>\n#include <cstdlib>\n#include <ctime>\n#include <cstring>\n#include <tr1/unordered_set>\n#include <tr1/unordered_map>\n\nusing namespace std;\nusing namespace tr1;\n\nint main(){\n    map<int,int> S;\n    S.clear();\n    int f[6];\n    for(int i=0;i<6;i++){\n        scanf(\"%d\",&f[i]);\n        S[f[i]]++;\n    }\n    bool flag=false;\n    for(int i=0;i<6;i++)\n        if(S[f[i]]>=4){\n            S[f[i]]-=4;\n            flag=true;\n            break;\n        }\n    if(!flag){\n        puts(\"Alien\");\n        return 0;\n    }\n    flag=false;\n    for(int i=0;i<6;i++)\n        if(S[f[i]]==2)flag=true;\n    if(flag)puts(\"Elephant\");\n    else puts(\"Bear\");\n    return 0;\n}\n"
    ],
    "input": "",
    "output": "",
    "tags": [
        "implementation"
    ],
    "dificulty": "1100",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV2\\A. MUH and Sticks.json",
    "editorial_link": "https://codeforces.com//blog/entry/13986",
    "editorial": "Given six sticks and their lengths we need to decide whether we can make\r\nan elephant or a bear using those sticks. The only common requirement\r\nfor both animals is that four leg-sticks should have same length. This\r\nmeans that the answer \"Alien\" should be given only if we canâ\u0080\u0099t find four\r\nsticks for the legs. Otherwise we will be able to make some animal. The\r\ntype of the animal will depend on the relation of the remaining sticksâ\u0080\u0099\r\nlengths. If they are equal then it will an elephant, if they are\r\ndifferent we will have a bear. So this algorithm should solve the\r\nproblem: Find the number which appears at least four times in the input.\r\nIf no such number exist then the answer is \"Alien\". Otherwise remove\r\nfour entries of that number from the input. After removing that number\r\nyou will have two numbers left, compare them and decide whether itâ\u0080\u0099s an\r\nelephant or a bear. One shortcut for this problem might be to sort the\r\ninput array, then if itâ\u0080\u0099s a bear or an elephant then 3rd and 4th\r\nelements in the sorted should be animalâ\u0080\u0099s legs. So you can assume that\r\none of these numbers is the length of the leg and count how many times\r\nyou see this number in the input. Authorâ\u0080\u0099s solution: 7977022 Since the\r\nnumbers in the input are very small you can implement â\u0080\u0099brute forceâ\u0080\u0099\r\nsolution as well. By brute force solution in this case I mean that you\r\ncan actually check all possible values for leg-length, head-length and\r\nbody-length. If in total they give the same set as the input then you\r\nfound a matching, all you need is to check whether itâ\u0080\u0099s a bear or an\r\nelephant. And itâ\u0080\u0099s an alien if you checked all possible combinations and\r\nfound nothing matching to the input. Though in this case the brute force\r\nsolution is not easier than another one. Checking all possible lengths\r\nsolution: 7975645 It seems that there were two common mistakes people\r\nwere making in this problem: Not taking into account that legs can be of\r\nthe same length as body or head. So you canâ\u0080\u0099t just count the number of\r\ndistinct numbers in the input to decide which type of animal is that. We\r\nassumed that people might make such a mistake, there was a relevant\r\nwarning in the statement. Trying to sort the input and then check\r\nwhether some elements in this array are equal to other elements and\r\nbased on this comparison decide which type of animal is that. People\r\nwere simply making mistakes when deciding which elements to compare. The\r\ncorrect way to implement this is: Solution: 7977214 This solution seems\r\nto be shorter but there are many failed solutions like this because\r\npeople were not paying enough attention to the details. So I would\r\nprefer implementing more straightforward approach. Hope you liked the\r\npictures!\r\n"
}