{
    "link": "https://codeforces.com//contest/673/problem/B",
    "problemId": "59807",
    "problem_idx": "B",
    "shortId": "673B",
    "contest_number": "673",
    "problem_submissions": {
        "E": [
            17790544,
            17790298,
            17792643,
            17795142,
            17797198,
            17796072,
            17796678,
            17794290,
            17802948,
            18498821,
            18454059,
            18453934,
            18453804,
            27208468,
            17814502,
            17814492,
            17810486
        ],
        "A": [
            17785371,
            17780028,
            17783006,
            17781229,
            17780841,
            17781392,
            17781436,
            17783310,
            17780077,
            17780098,
            17783943,
            17780241,
            17780697,
            17780142,
            17780713,
            17780906,
            17780033,
            17782963,
            17780095,
            17780488
        ],
        "D": [
            17784968,
            17784163,
            17787638,
            17787311,
            17788261,
            17790516,
            17791783,
            17788147,
            17787202,
            17788591,
            17787856,
            17787228,
            17787665,
            17788331,
            17788505,
            17790808,
            17791801,
            17789992,
            17788978,
            17790173
        ],
        "B": [
            17783887,
            17780728,
            17785147,
            17782968,
            17783327,
            17784516,
            17785052,
            17786520,
            17783375,
            17784877,
            17782865,
            17784125,
            17784706,
            17782517,
            17784194,
            17786784,
            17781561,
            17784108,
            17784745,
            17783935
        ],
        "C": [
            17780670,
            17782033,
            17785575,
            17788307,
            17784829,
            17786955,
            17787316,
            17789788,
            17784945,
            17782021,
            17781157,
            17785332,
            17782835,
            17785106,
            17786557,
            17783986,
            17790134,
            17785539,
            17783083,
            17786914
        ],
        "F": [
            17799743
        ]
    },
    "name": "B. Problems for Round",
    "statement": "There are problems prepared for the next Codeforces round. They are\r\narranged in ascending order by their difficulty, and no two problems\r\nhave the same difficulty. Moreover, there are pairs of similar problems.\r\nAuthors want to split problems between two division according to the\r\nfollowing rules: Problemset of each division should be non-empty. Each\r\nproblem should be used in exactly one division (yes, it is unusual\r\nrequirement). Each problem used in division 1 should be harder than any\r\nproblem used in division 2. If two problems are similar, they should be\r\nused in different divisions. Your goal is count the number of ways to\r\nsplit problem between two divisions and satisfy all the rules. Two ways\r\nto split problems are considered to be different if there is at least\r\none problem that belongs to division 1 in one of them and to division 2\r\nin the other.Note, that the relation of similarity transitive. That is,\r\nif problem is similar to problem and problem is similar to problem , it\r\ndoesn’t follow that is similar to .\r\n",
    "solutions": [
        "#include <stdio.h>\n#include <stdlib.h>\n#include <string.h>\n#include <memory.h>\n#include <math.h>\n#include <assert.h>\n#include <stack>\n#include <queue>\n#include <map>\n#include <set>\n#include <algorithm>\n#include <string>\n#include <functional>\n#include <vector>\n#include <numeric>\n#include <deque>\n#include <utility>\n#include <bitset>\n#include <limits.h>\n#include <iostream>\n\nusing namespace std;\ntypedef long long ll;\ntypedef unsigned long long llu;\ntypedef double lf;\ntypedef unsigned int uint;\ntypedef long double llf;\ntypedef pair<int, int> pii;\ntypedef pair<ll, ll> pll;\n\nconst int N_ = 100500;\nconst int M_ = 100500;\n\nint N, M;\nvector<int> gph[N_];\n\nvector<int> A, B;\n\nint main() {\n\tscanf(\"%d%d\", &N, &M);\n\tfor(int e = 1; e <= M; e++) {\n\t\tint u, v; scanf(\"%d%d\", &u, &v);\n\t\tif(u > v) swap(u, v);\n\t\tA.push_back(u); B.push_back(v);\n\t}\n\n\tif(M == 0) {\n\t\tprintf(\"%d\\n\", N-1);\n\t}else {\n\t\tint a = *max_element(A.begin(), A.end());\n\t\tint b = *min_element(B.begin(), B.end());\n\t\tprintf(\"%d\\n\", max(0, b-a));\t\n\t}\n    return 0;\n}\n"
    ],
    "input": "",
    "output": "",
    "tags": [
        "greedy",
        "implementation"
    ],
    "dificulty": "1300",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV2\\B. Problems for Round.json",
    "editorial_link": "https://codeforces.com//blog/entry/44754",
    "editorial": "Some prefix of problems must belong to one\ndivision, and the remaining suffix must belong to the other division.\nThus, we can say that we should choose the place (between two numbers)\nwhere we split problems. Each pair (letâs say that ) means that the\nsplitting place must be between and . In other words, it must be on the\nright from and on the left from . For each pair if then we swap these\ntwo numbers. Now, the splitting place must be on the right from , so it\nmust be on the right from . In linear time you can calculate , and\nsimilarly calculate . Then, the answer is . It may turn out that though\nbut we donât want to print a negative answer. So, we should print .\n18286633 (invented by Errichto) We are going to iterate over all\nintervals. Letâs first fix the left end of the interval and denote it by\n. Now, we iterate over the right end . When we go from to then we get\none extra ball with color . In one global array we can keep the number\nof occurrences of each color (we can clear the array for each new ). We\nshould increase by one and then check whether becomes a new dominant\ncolor. But how to do it? Additionally, letâs keep one variable with the\ncurrent dominant color. When we go to then we should whether or ( and ).\nThe second condition checks which color has smaller index (in case of a\ntie). And we must increase by one then because we know that is dominant\nfor the current interval. At the end, print values . 18286663 (invented\nby Errichto) There is no solution if or . But for and you can construct\nthe following graph: Here, cities denote other cities in any order you\nchoose (cities different than ). You should print in the first line, and\nin the second line. Two not very hard challenges for you. Are you able\nto prove that the answer doesnât exist for ? Can you solve the problem\nif the four given cities donât have to be distinct but itâs guaranteed\nthat and ? 18286683 (invented by Radewoosh) When we repeat something and\neach time we have probability to succeed then the expected number or\ntries is , till we succeed. How to calculate the expected time for one\nregion ? For each in some moment we will try to beat this level and then\nthere will be tokens in the bag, including tokens allowing us to beat\nthis new level. The probability to succeed is , so the expected time is\n. So, in total we should sum up values for . Ok, we managed to\nunderstand the actual problem. You can now stop and try to find a slow\nsolution in . Hint: use the dynamic programming. Now letâs write formula\nfor , as the minimum over denoting the end of the previous region: So we\ncan use convex hull trick to calculate it in . You should also get AC\nwith a bit slower divide&conquer trick, if itâs implemented carefully.\n18286696 (invented by Radewoosh) Letâs say that every company has one\nparent (a company it follows). Also, every copmany has some (maybe\nempty) set of children. Itâs crucial that sets of children are disjoint.\nFor each company letâs keep (and always update) one value, equal to the\nsum of: It turns out that after each query only the above sum changes\nonly for a few values. If starts to follows then you should care about .\nAnd maybe and if you want to be sure. You can stop reading now for a\nmoment and analyze that indeed other companies will keep the same sum,\ndescribed above. Ok, but so far we donât count the income coming from\nparentâs fanpage. But, for each company we can store all its children in\none set. All children have the same \"income from parentâs fanpage\"\nbecause they have the same parent. So, in set you can keep children\nsorted by the sum described above. Then, we should always puts the\nextreme elements from sets in one global set. In the global set you care\nabout the total income, equal to the sum described above and this new\n\"income from parent\". Check codes for details. The complexity should be\n, with big constant factor. 18286747 (invented by Errichto) Let denote\nthe probability that subtree (if attacked now) would have height at most\n. The first observation is that we donât care about big because itâs\nvery unlikely that a path with e.g. 100 edges will survive. Letâs later\ntalk about choosing and now letâs say that itâs enough to consider up to\n. When we should answer a query for subtree then we should sum up to get\nthe answer. The other query is harder. Letâs say that a new vertex is\nattached to vertex . Then, among only changes (other values stay the\nsame). Also, one value changes, and so does and so on. You should\niterate over vertices (each time going to parent) and update the\ncorresponding value. TODO puts here come formula for updating value. The\ncomplexity is . You may think that is enough because is small enough.\nUnfortunately, there exist malicious tests. Consider a tree with paths\nfrom root, each with length . Now, we talk about the probability of\nmagnitude: which is more than for .\nhttp://www.wolframalpha.com/input/?i=1+-+(1-(1\n",
    "hint": []
}