{"link": "https://codeforces.com//contest/190/problem/B", "problemId": "1330", "problem_idx": "B", "shortId": "190B", "contest_number": "190", "problem_submissions": {"E": [1695983, 1695624, 1697050, 1695708, 1695790], "D": [1695462, 1695449, 1695835, 1695364, 1695377, 1695368, 1695946, 1696839, 1695863, 1695763, 1694579, 1694803, 1694964, 1696526, 1694501, 1695160], "C": [1694760, 1694875, 1695279, 1694796, 1694088, 1695233, 1696929, 1695405, 1695351], "B": [1692770, 1693945, 1696858, 1693150, 1695603, 1696081, 1696565], "A": [1691163, 1691408, 1691387, 1691381, 1691523, 1691170, 1691984, 1691301, 1691155, 1691192, 1691038, 1690947, 1691166, 1691782, 1695491, 1691072]}, "name": "B. Surrounded", "statement": "So, the Berland is at war with its eternal enemy Flatland again, and\r\nVasya, an accountant, was assigned to fulfil his duty to the nation.\r\nRight now the situation in Berland is dismal their both cities are\r\nsurrounded! The armies of flatlanders stand on the borders of circles,\r\nthe circles’ centers are in the surrounded cities. At any moment all\r\npoints of the flatland ring can begin to move quickly in the direction\r\nof the city that’s the strategy the flatlanders usually follow when they\r\nbesiege cities.The berlanders are sure that they can repel the enemy’s\r\nattack if they learn the exact time the attack starts. For that they\r\nneed to construct a radar that would register any movement at the\r\ndistance of at most from it. Thus, we can install a radar at such point,\r\nthat at least one point of the enemy ring will be in its detecting range\r\n(that is, at a distance of at most ). Then the radar can immediately\r\ninform about the enemy’s attack. Due to the newest technologies, we can\r\nplace a radar at any point without any problems. But the problem is that\r\nthe berlanders have the time to make only one radar. Besides, the larger\r\nthe detection radius is, the more the radar costs.That’s why Vasya’s\r\ntask (that is, your task) is to find the minimum possible detection\r\nradius for the radar. In other words, your task is to find the minimum\r\nradius such, that a radar with radius can be installed at some point and\r\nit can register of both flatland rings from that point. In this problem\r\nyou can consider the cities as material points, the attacking enemy\r\nrings - as circles with centers in the cities, the radar’s detection\r\nrange as a disk (including the border) with the center at the point\r\nwhere the radar is placed.\r\n", "solutions": ["#include <stdio.h>\n#include <math.h>\nint main()\n{\n    int x1,y1,r1,x2,y2,r2;\n    while (scanf(\"%d%d%d%d%d%d\",&x1,&y1,&r1,&x2,&y2,&r2)==6)\n    {\n        int delta1=(r2+r1)*(r2+r1);\n        int delta2=(r2-r1)*(r2-r1);\n        int delta3=(x2-x1)*(x2-x1)+(y2-y1)*(y2-y1);\n        if (delta3>=delta1)\n        {\n            printf(\"%.10f\\n\",(sqrt(delta3*1.0)-r1-r2)/2.0);\n        }\n        else if (delta3<=delta2)\n        {\n            printf(\"%.10f\\n\",(fabs(r2*1.0-r1)-sqrt(delta3*1.0))/2.0);\n        }\n        else\n            puts(\"0.00000000000\");\n    }\n    return 0;\n}\n"], "input": "", "output": "", "tags": ["geometry"], "dificulty": "1800", "interactive": false}