{
    "link": "https://codeforces.com//contest/785/problem/C",
    "problemId": "98355",
    "problem_idx": "C",
    "shortId": "785C",
    "contest_number": "785",
    "problem_submissions": {
        "E": [
            25535913,
            25520701,
            25521367,
            25524258,
            25516770,
            25518668,
            25525495,
            25517389,
            25526683,
            25519510,
            25510315,
            25516733,
            25699539,
            25521276,
            25540389,
            25540369,
            25522122,
            25560171,
            25522262
        ],
        "D": [
            25514969,
            25516920,
            25517547,
            25523665,
            25527515,
            25519834,
            25527742,
            25518744,
            25524873,
            25653943,
            25515800,
            25517945,
            25515992,
            25518919,
            25517044,
            25522041
        ],
        "C": [
            25509527,
            25508471,
            25509773,
            25536741,
            25508063,
            25509604,
            25510288,
            25520657,
            25513296,
            25522523,
            25517091,
            25519490,
            25510828,
            25511108,
            25511948,
            25512218,
            25511493,
            25510575,
            25511287,
            25511649,
            25508687
        ],
        "B": [
            25505453,
            25505566,
            25506791,
            25505538,
            25504971,
            25506495,
            25505802,
            25505209,
            25507435,
            25512598,
            25507000,
            25506314,
            25505276,
            25506234,
            25507471,
            25504662,
            25505140,
            25505996,
            25505311,
            25505921
        ],
        "A": [
            25502237,
            25502308,
            25504008,
            25502246,
            25501830,
            25501715,
            25502679,
            25501866,
            25503109,
            25511198,
            25501880,
            25502005,
            25502194,
            25502627,
            25503151,
            25502062,
            25501702,
            25506739,
            25501679,
            25502337
        ]
    },
    "name": "C. Anton and Fairy Tale",
    "statement": "Anton likes to listen to fairy tales, especially when Danik, Anton’s\r\nbest friend, tells them. Right now Danik tells Anton a fairy tale:\"Once\r\nupon a time, there lived an emperor. He was very rich and had much\r\ngrain. One day he ordered to build a huge barn to put there all his\r\ngrain. Best builders were building that barn for three days and three\r\nnights. But they overlooked and there remained a little hole in the\r\nbarn, from which every day sparrows came through. Here flew a sparrow,\r\ntook a grain and flew away...\"More formally, the following takes place\r\nin the fairy tale. At the beginning of the first day the barn with the\r\ncapacity of grains was full. Then, every day (starting with the first\r\nday) the following happens: grains are brought to the barn. If grains\r\ndoesn’t fit to the barn, the barn becomes full and the grains that\r\ndoesn’t fit are brought back (in this problem we can assume that the\r\ngrains that doesn’t fit to the barn are not taken into account).\r\nSparrows come and eat grain. In the -th day sparrows come, that is on\r\nthe first day one sparrow come, on the second day two sparrows come and\r\nso on. Every sparrow eats one grain. If the barn is empty, a sparrow\r\neats nothing. Anton is tired of listening how Danik describes every\r\nsparrow that eats grain from the barn. Anton doesn’t know when the fairy\r\ntale ends, so he asked you to determine, by the end of which day the\r\nbarn will become empty for the first time. Help Anton and write a\r\nprogram that will determine the number of that day!\r\n",
    "solutions": [
        "#include<cstdio>\n#include<cstring>\n#include<cstdlib>\n#include<algorithm>\n\nusing namespace std;\ntypedef long long LL;\nLL n,m;\nint main(){\n\tscanf(\"%lld%lld\",&n,&m);\n\tif(m>=n)printf(\"%lld\\n\",n);\n\telse{\n\t\tLL l=0LL,r=1LL<<31;\n\t\twhile(l<r){\n\t\t\tLL mid=(l+r)>>1;\n\t\t\tif(m+((mid*(mid+1))>>1)<n)l=mid+1;else r=mid;\n\t\t}\n\t\tprintf(\"%lld\\n\",m+l);\n\t}\n\treturn 0;\n}\n"
    ],
    "input": "",
    "output": "",
    "tags": [
        "binary search",
        "math"
    ],
    "dificulty": "1600",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV2\\C. Anton and Fairy Tale.json",
    "editorial_link": "https://codeforces.com//blog/entry/50996",
    "editorial": "At first, letâ\u0080\u0099s make the following assumption: if a sparrow cannot eat a\r\ngrain because the barn is empty, the number of grains in the barn\r\nbecomes negative. Itâ\u0080\u0099s easy to see that the answer doesnâ\u0080\u0099t change\r\nbecause of this.Now, letâ\u0080\u0099s observe the number of grains before sparrows\r\ncome. At first, the barn remains full for days (because sparrows eat\r\nless grains than itâ\u0080\u0099s added to the barn). Then the number of grains is\r\ndecreased by one, by two and so on. So, on the -th day there are grains\r\nin the barn before sparrows come (remember that for any positive integer\r\nthe equality is always true).How can we determine if the barn is empty?\r\nItâ\u0080\u0099s reasonable that if there are grains on the -th day after grain is\r\nbrought, then at the end of the -th day there are grains in the barn.\r\nSo, if on the -th day the barn becomes empty (), then there must be\r\ngrains on the -th day after grain is brought.So, we must find such\r\nminimal day , in which there are or less grains after grain is brought.\r\nThat is, using the formula above, we must find such minimal thatIt can\r\nbe easily done using binary search. Itâ\u0080\u0099s not hard to observe that the\r\nanswer in this case is (if in the -th day before sparrows come there are\r\nless or equal than grains, then in the -th day the barn is empty).The\r\ncorner case in this problem is . In this case the barn becomes full\r\nevery day and it becomes empty only in the -th day when sparrows eat all\r\nthe grain.Also notice that can be found using a formula, but such\r\nsolutions could fail by accuracy, because the formula is using the\r\nsquare root function.Time complexity is .\r\n"
}