{
    "link": "https://codeforces.com//contest/1080/problem/C",
    "problemId": "259655",
    "problem_idx": "C",
    "shortId": "1080C",
    "contest_number": "1080",
    "problem_submissions": {
        "F": [
            46161976,
            46162778,
            46160192,
            46159146,
            46160650,
            46161330,
            46177225,
            46181279,
            46177040,
            46159242,
            46165879,
            46244094
        ],
        "E": [
            46159833,
            46158289,
            46156414,
            46159947,
            46162060,
            46170130,
            46156194,
            46160134,
            46157810,
            46160983,
            46162313,
            46162730,
            46268200,
            46162883,
            46161436,
            46165893,
            46162523,
            46157004,
            46162154
        ],
        "D": [
            46156149,
            46155986,
            46154022,
            46155513,
            46158228,
            46156068,
            46156726,
            46159618,
            46156456,
            46155088,
            46157318,
            46173998,
            46159164,
            46155242,
            46156719,
            46155734,
            46161044,
            46159764
        ],
        "C": [
            46152444,
            46149941,
            46152568,
            46150576,
            46153451,
            46151555,
            46151650,
            46150697,
            46153316,
            46152202,
            46153935,
            46150267,
            46152022,
            46151720,
            46151339,
            46154831,
            46152462,
            46152573,
            46153346,
            46152817
        ],
        "B": [
            46149045,
            46145345,
            46149235,
            46146926,
            46149668,
            46147319,
            46152091,
            46147240,
            46146639,
            46147840,
            46147532,
            46146841,
            46147485,
            46146840,
            46146905,
            46150391,
            46147300,
            46147235,
            46147802,
            46148682
        ],
        "A": [
            46146332,
            46144961,
            46147960,
            46145347,
            46146629,
            46145256,
            46151812,
            46146189,
            46145164,
            46147556,
            46144974,
            46145039,
            46145991,
            46145058,
            46145185,
            46149238,
            46145401,
            46145176,
            46145572,
            46145659
        ]
    },
    "name": "C. Masha and two friends",
    "statement": "Recently, Masha was presented with a chessboard with a height of n and a\r\nwidth of m.The rows on the chessboard are numbered from 1 to n from\r\nbottom to top. The columns are numbered from 1 to m from left to right.\r\nTherefore, each cell can be specified with the coordinates (x,y), where\r\nx is the number, and y is the number .Let us call a rectangle with\r\ncoordinates (a,b,c,d) a rectangle lower left point of which has\r\ncoordinates (a,b), and the upper right one (c,d).The chessboard is\r\npainted black and white as follows: Masha was very happy with the gift\r\nand, therefore, invited her friends Maxim and Denis to show off. The\r\nguys decided to make her a treat they bought her a can of white and a\r\ncan of black paint, so that if the old board deteriorates, it can be\r\nrepainted. When they came to Masha, something unpleasant happened:\r\nfirst, Maxim went over the threshold and spilled paint on the rectangle\r\n(x_1,y_1,x_2,y_2). Then after him Denis spilled paint on the rectangle\r\n(x_3,y_3,x_4,y_4).To spill paint of color color onto a certain rectangle\r\nmeans that all the cells that belong to the given rectangle become\r\ncolor. The cell dyeing is superimposed on each other (if at first some\r\ncell is spilled with white paint and then with black one, then its color\r\nwill be black).Masha was shocked! She drove away from the guests and\r\ndecided to find out how spoiled the gift was. For this, she needs to\r\nknow the number of cells of white and black color. Help her find these\r\nnumbers!\r\n",
    "solutions": [
        "#include <algorithm>\n#include <cstdio>\n#include <cstring>\n\ntypedef long long LL;\n\nconst int W = 0;\nconst int B = 1;\n\nLL count(int x1, int y1, int x2, int y2, int color) {\n  if (x1 > x2 || y1 > y2) return 0;\n  LL ans = (LL)(x2 - x1 + 1) * (y2 - y1 + 1) / 2;\n  if (!(((x2 ^ x1) | (y2 ^ y1) | (x1 ^ y1 ^ color)) & 1))\n    ++ans;\n  //printf(\"%d %d %d %d %c %I64d\\n\", x1, y1, x2, y2, \"WB\"[color], ans);\n  return ans;\n}\n\nint main(){\n  int q;\n  scanf(\"%d\", &q);\n  while (q--) {\n    int X, Y, x1, y1, x2, y2, x3, y3, x4, y4;\n    scanf(\"%d%d%d%d%d%d%d%d%d%d\", &Y, &X, &x1, &y1, &x2, &y2, &x3, &y3, &x4, &y4);\n    LL w = count(1, 1, X, Y, W) + count(x1, y1, x2, y2, B) - count(x3, y3, x4, y4, W)\n         - count(std::max(x1, x3), std::max(y1, y3), std::min(x2, x4), std::min(y2, y4), B);\n    printf(\"%I64d %I64d\\n\", w, (LL)X * Y - w);\n  }\n  return 0;\n}"
    ],
    "input": "",
    "output": "",
    "tags": [
        "implementation"
    ],
    "dificulty": "1500",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV2\\C. Masha and two friends.json",
    "editorial_link": "https://codeforces.com//blog/entry/63436",
    "editorial": "At first letâ\u0080\u0099s define a function , which returns the number of white\r\ncells on the subrectangle, the left bottom corner of which has\r\ncoordinates and the top right one has coordinates . (I will tell you how\r\nto implement the function later).How do we solve the problem using this\r\nfunction?Letâ\u0080\u0099s define functions and , which return the number of white\r\ncells on the subrectangle which has coordinates and the number of black\r\ncells on the subrectangle which has coordinates . (The definition of\r\nwhat we call the coordinates of a rectangle can be found in the\r\nstatements)It can be easily proven that The value of can be found as the\r\nnumber of all cells substracted by the number of the white cells: It\r\nmeans that in order to calculate the value of functions and efficiently\r\nit is enough to be able to calculate the value of efficiently.How de\r\nsolve the problem using the funcitons defined above?Step 1. We should\r\nfind the number of black cells and white cells in the initial chessboard\r\n(these values will be stored in the variables called and respectivly):\r\nStep 2. All the black cells in the rectangle will become white. So now:\r\nStep 3. Now all the white cells in the rectangle will become black. So\r\nnow: But since the functions functions and return the number of cells\r\nblack and white cells respectively in the board, so it isnâ\u0080\u0099t enough.\r\nWhat we did in the intersection of the rectangles:On step 2 we took the\r\ncells that were initially black and coloured them in white (everything\r\nis ok by now), but on step 3 we took only the cells that were initially\r\nwhite and coloured them in black. The cells that were initially black\r\nand coloured in white on step 2 were not coloured in black. In order to\r\nfix this we should find the rectangle which is an intersection of the\r\nrectangles and , find the number of black cells in it and then colour\r\nthem in black.It is obvious that the coordinates of the itersection of\r\nthe rectangle are .If or then there is no intersection, so we can just\r\nterminate the program.In another case we should apply: So we solved the\r\ntask. Now itâ\u0080\u0099s time to tell how to implement function .Letâ\u0080\u0099s consider\r\nfollowing chessboards from the examples: In order to explain more\r\neasily, I will name the pattern like this And the pattern like this : It\r\ncan be easily seen that if the number of rows is even, then the number\r\nof rows of both types is equal to .If the number of rows is odd, then\r\nthe number of rows of the type 2 is equal to and the number of rows of\r\nthe type 1 is equal to . Since if is even then we can just assume that\r\nthe number of rows with pattern type 1 is and the number of rows with\r\npattern type 2 is .In the same way we can prove that the number of white\r\ncells in one row with pattern type 1 is equal to and in the pattern type\r\n2 it is equal to .So now:Overall complexity .\r\n"
}