{"link": "https://codeforces.com//contest/168/problem/C", "problemId": "1057", "problem_idx": "C", "shortId": "168C", "contest_number": "168", "problem_submissions": {"B": [1428836, 1427139, 1426253, 1427986, 1430335, 1427853, 1424590, 1424980, 1424310], "D": [1426871, 1430554, 1429305, 1431245, 1429653, 1430817, 1430384, 1431850, 30408057], "C": [1425388, 1426092, 1431178, 1426649, 1431983, 1430173, 1426526, 1428307, 1425447, 1426498, 1426931], "A": [1423734, 1423629, 1423811, 1423781, 1424797, 1423644, 1423482, 1423449, 1423414, 1423417, 1423345], "E": [1436307]}, "name": "C. Wizards and Trolleybuses", "statement": "In some country live wizards. They love to ride trolleybuses.A city in\r\nthis country has a trolleybus depot with trolleybuses. Every day the\r\ntrolleybuses leave the depot, one by one and go to the final station.\r\nThe final station is at a distance of meters from the depot. We know for\r\nthe -th trolleybus that it leaves at the moment of time seconds, can go\r\nat a speed of no greater than meters per second, and accelerate with an\r\nacceleration no greater than meters per second squared. A trolleybus can\r\ndecelerate as quickly as you want (magic!). It can change its\r\nacceleration as fast as you want, as well. Note that the maximum\r\nacceleration is the same for all trolleys.Despite the magic the trolleys\r\nare still powered by an electric circuit and cannot overtake each other\r\n(the wires are to blame, of course). If a trolleybus catches up with\r\nanother one, they go together one right after the other until they\r\narrive at the final station. Also, the drivers are driving so as to\r\narrive at the final station as quickly as possible.You, as head of the\r\ntrolleybuses’ fans’ club, are to determine for each trolley the minimum\r\ntime by which it can reach the final station. At the time of arrival at\r\nthe destination station the trolleybus does not necessarily have zero\r\nspeed. When a trolley is leaving the depot, its speed is considered\r\nequal to zero. From the point of view of physics, the trolleybuses can\r\nbe considered as material points, and also we should ignore the impact\r\non the speed of a trolley bus by everything, except for the acceleration\r\nand deceleration provided by the engine.\r\n", "solutions": ["#include<iostream>\n#include<cstring>\n#include<cmath>\n#include<cstdio>\n\nusing namespace std;\n\nint N;\ndouble A,S,cepat,waktu;\n\nint main() {\n\tscanf(\"%d %lf %lf\",&N,&A,&S);\n\tdouble jawab = 0.0;\n\tfor (int i=1;i<=N;++i) {\n\t\tscanf(\"%lf %lf\",&waktu,&cepat);\n\t\tif ((cepat*cepat) / (2.0*A) < S) waktu += (cepat/A) + (S-(cepat*cepat) / (2.0*A)) / cepat;\n\t\telse waktu += sqrt(2.0*S / A);\n\t\tjawab = max(jawab,waktu);\n\t\tprintf(\"%.6lf\\n\",jawab);\n\t}\n\treturn 0;\n}"], "input": "", "output": "", "tags": ["implementation", "math"], "dificulty": "1600", "interactive": false}