{
    "link": "https://codeforces.com//contest/595/problem/D",
    "problemId": "40376",
    "problem_idx": "D",
    "shortId": "595D",
    "contest_number": "595",
    "problem_submissions": {
        "C": [
            14183245,
            14174366,
            14176948,
            14185132,
            14199391
        ],
        "E": [
            14154107,
            14157574,
            14160562,
            14158642
        ],
        "B": [
            14147982,
            14150411,
            14148010,
            14147720,
            14155014,
            14149149,
            14148880,
            14150127,
            14148035,
            14147384,
            14147369,
            14149951,
            14147539,
            14148771,
            14147615
        ],
        "A": [
            14144272,
            14144928,
            14145367,
            14144629,
            14144372,
            14144556,
            14144252,
            14144455,
            14146378,
            14144766,
            14145785,
            14144276,
            14144350,
            14144811,
            14144491,
            14144489,
            14144288
        ],
        "D": [
            14159968,
            14156852,
            14157577,
            14154481,
            14163683
        ]
    },
    "name": "D. Max and Bike",
    "statement": "For months Maxim has been coming to work on his favorite bicycle. And\r\nquite recently he decided that he is ready to take part in a cyclists’\r\ncompetitions.He knows that this year competitions will take place.\r\nDuring the -th competition the participant must as quickly as possible\r\ncomplete a ride along a straight line from point to point ().Measuring\r\ntime is a complex process related to usage of a special sensor and a\r\ntime counter. Think of the front wheel of a bicycle as a circle of\r\nradius . Let’s neglect the thickness of a tire, the size of the sensor,\r\nand all physical effects. The sensor is placed on the rim of the wheel,\r\nthat is, on some fixed point on a circle of radius . After that the\r\ncounter moves just like the chosen point of the circle, i.e. moves\r\nforward and rotates around the center of the circle.At the beginning\r\neach participant can choose point , such that his bike is fully behind\r\nthe starting line, that is, . After that, he starts the movement,\r\ninstantly accelerates to his maximum speed and at time , when the\r\ncoordinate of the sensor is equal to the coordinate of the start, the\r\ntime counter starts. The cyclist makes a complete ride, moving with his\r\nmaximum speed and at the moment the sensor’s coordinate is equal to the\r\ncoordinate of the finish (moment of time ), the time counter deactivates\r\nand records the final time. Thus, the counter records that the\r\nparticipant made a complete ride in time . Maxim is good at math and he\r\nsuspects that the total result doesn’t only depend on his maximum speed\r\n, but also on his choice of the initial point . Now Maxim is asking you\r\nto calculate for each of competitions the minimum possible time that can\r\nbe measured by the time counter. The radius of the wheel of his bike is\r\nequal to .\r\n",
    "solutions": [
        "#include<cstdio>\n#include<cmath>\nconst double PI=acos(-1.0),EPS=1e-9;\nint N;\ndouble R,V,S,F;\nint main()\n{\n\tscanf(\"%d%lf%lf\",&N,&R,&V);\n\twhile(N--)\n\t{\n\t\tscanf(\"%lf%lf\",&S,&F);\n\t\tdouble len=F-S,ans=0.0;\n\t\tdouble remain=fmod(len,2.0*PI*R);\n\t\tans+=len-remain;\n\t\tremain*=0.5;\n\t\tdouble l=0.0,r=PI;\n\t\twhile(remain-(R*l+R*sin(l))>EPS*remain)\n\t\t{\n\t\t\tdouble mid=0.5*(l+r);\n\t\t\tif(R*mid+R*sin(mid)<=remain)l=mid;\n\t\t\telse r=mid;\n\t\t}\n\t\tans+=2.0*(l*R);\n\t\tprintf(\"%.9f\\n\",ans/V);\n\t}\n\treturn 0;\n}\n"
    ],
    "input": "",
    "output": "",
    "tags": [
        "geometry"
    ],
    "dificulty": "2500",
    "interactive": false,
    "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV2\\D. Max and Bike.json",
    "editorial_link": "https://codeforces.com//blog/entry/21487",
    "editorial": "The main proposition to solve this problem \u0097 in the middle of every competition the sensor must be or in the top point of the wheel or in the bottom point of the wheel.\n\nTo calculate the answer we need to use binary search. If the center of the wheel moved on the distance c, then the sensor moved on the distance c?+?rsin(c?/?r), if the sensor was on the top point of the wheel in the middle, or on the distance c?-?rsin(c?/?r), if the sensor was on the bottom point of the wheel in the middle, where r \u0097 the radius of the wheel."
}