{"link": "https://codeforces.com//contest/2090/problem/F1", "problemId": "3285054", "problem_idx": "F1", "shortId": "2090F1", "contest_number": "2090", "problem_submissions": {"F1": [312018055, 312032091, 312022589, 312026146, 312026348, 312029929, 312121699, 312029733, 312010811, 312035399, 312035966], "E2": [312008366, 311997209, 312011442, 312131582, 312007673, 312017151, 312198341, 312025375, 312019337, 312023768], "E1": [311986918, 311985589, 311997643, 312002125, 312011814, 312007162, 312012015, 312024093, 312005969, 312009163, 312019736, 312014658, 312015402, 311999054], "D": [311981748, 312013273, 311977532, 311988779, 311995947, 311993651, 311995932, 311995855, 311977421, 312285706, 311999417, 311996259, 311986869, 311984103, 311979845], "C": [311976738, 311979187, 311992532, 311979110, 311985252, 311988752, 311990245, 312000901, 311995531, 311989782, 311987834, 311997584, 311995809, 311992221], "B": [311967026, 311965980, 311969127, 311965678, 311968637, 311968386, 311976645, 311975919, 311965722, 311970420, 311967286, 311980002, 311970149, 311965563, 311970509], "A": [311962004, 311960852, 311960409, 311960688, 311961026, 311961479, 311969155, 311963079, 311960524, 311960551, 311962617, 311965162, 311960721, 311960494, 311961369]}, "editorial_link": "https://codeforces.com//blog/entry/141053", "editorial": "", "name": "F1. Key of Like  Easy Version ", "statement": "A toy box is a refrigerator filled with childhood delight. Like\r\nweakness, struggle, hope ... When such a sleeper is reawakened, what\r\nkind of surprises will be waiting?M received her toy box as a birthday\r\npresent from her mother. A jewellery designer would definitely spare no\r\neffort in decorating yet another priceless masterpiece as a starry\r\nfirmament with exquisitely shaped gemstones. In addition, l distinct\r\nlocks secure the tiny universe of her lovely daughter: a hair clip\r\nfeaturing a flower design, a weathered feather pen, a balloon shaped\r\nlike the letter M ... each piece obscures a precious moment.A few days\r\nago, M rediscovered her toy box when she was reorganizing her bedroom,\r\nalong with a ring of keys uniquely designed for the toy box. Attached to\r\nthe key ring are (l + k) keys, of which l keys are able to open one of\r\nthe l locks correspondingly, while the other k keys are nothing but\r\ncounterfeits to discourage brute-force attack. To remind the\r\ncorrespondence, M’s mother adorned each key with a gemstone of a\r\ndifferent type. However, passing days have faded M’s memory away.\"... So\r\nI have to turn to you all,\" M said while laying that ring of keys on the\r\ntable.K picked up the keys and examined them carefully. \"The appearance\r\nof these keys unveils nothing fruitful. Thus, I am afraid that we shall\r\ninspect them sequentially.\"Although everyone is willing to help M,\r\nnobody has a plan. Observing others’ reactions, T suggested, \"Let’s play\r\na game. Everyone tries a key in turn, and who opens the most locks is\r\n.\"n members, including M herself, take turns to unlock the toy box\r\nrecursively in the same order until all the l locks are unlocked. At\r\neach turn, the current member only selects a single key and tests it on\r\nexactly one of the locks. To open the toy box as soon as possible, every\r\nmember chooses the key and the lock that maximize the probability of\r\nbeing a successful match. If there are multiple such pairs, a member\r\nwill randomly choose one of such pairs with equal probability.\r\nApparently, if a lock has been matched with a key, then neither the lock\r\nnor the key will be chosen again in following attempts.Assume that at\r\nthe very beginning, the probability that a lock can be opened by any key\r\nis equal. If everyone always tries the optimal pairs of keys and locks\r\nbased on all the historical trials, what will the expected number of\r\nsuccessful matches be for each member?\r\n", "solutions": [], "input": "", "output": "", "tags": ["combinatorics", "dp", "math", "probabilities"], "dificulty": "2200", "interactive": false, "file_name": "D:\\scoala\\RESEARCH\\MLCP\\01_CODEFORCES_DATASET\\DIV2\\F1. Key of Like  Easy Version .json"}